#+BEGIN_HTML
---
layout: post
title: Heap queue
tagline: " algorithm dissection"
permalink: /python/stdlib/heapq.html
categories: [emacs, Python, algorithms, heap, literate programming]
tags: [heap queue, stdlib, heapq]
---
#+END_HTML
#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 3

*** Heap of tuples
     
    #+BEGIN_SRC python :results output :session stdlib :exports both
      from heapq import heappop


      h = []
      heappush(h, (5, 'write code'))
      heappush(h, (7, 'release product'))
      heappush(h, (1, 'write spec'))
      heappush(h, (3, 'create tests'))
      print(type(h),'\n', h)
      heappop(h)
    #+END_SRC

    #+RESULTS:
    : 
    : >>> >>> >>> >>> >>> >>> >>> <class 'list'> 
    :  [(1, 'write spec'), (3, 'create tests'), (5, 'write code'), (7, 'release product')]
    : (1, 'write spec')


    As you might recon a heap in this particular case is a specific list,
    which is sorted on the fly.

    #+BEGIN_SRC python :results output :session stdlib :exports both
    heappush(h, (6, 'test it up'))
    print('\n', h)
    #+END_SRC

    #+RESULTS:
    : 
    : [(3, 'create tests'), (6, 'test it up'), (5, 'write code'), (7, 'release product')]


    Obviously that order is corrupted, but it is strictly following by the
    =heap= definition.

    #+BEGIN_SRC python :results output :session stdlib :exports both
    heappop(h)
    print('\n', h)
    heappop(h)
    #+END_SRC

    #+RESULTS:
    : (3, 'create tests')
    : [(5, 'write code'), (6, 'test it up'), (7, 'release product')]
    : (5, 'write code')
    
